<template>
  <div>
    <!-- Секция "Немного о нас" -->
    <div class="about-us">
      <h2>Немного о нас</h2>
      <p>
        На нашем сайте мы стремимся сделать ваш кулинарный опыт простым, выгодным и удобным. Мы понимаем,
        как важно не только выбрать вкусный рецепт, но и найти, где приобрести ингредиенты по наиболее
        выгодной цене и с минимальными усилиями.
      </p>
    </div>

    <!-- Секция "Наши разработчики" -->
    <div class="developers">
      <h2>Наши разработчики</h2>
      <p>Рудницкий-Антипов Георгий</p>
      <p>Сопина Яна</p>
      <p>Соколов Степан</p>
      <p>Коротких Артём</p>
      <p>Муртазин Руслан</p>
    </div>
  </div>
</template>
<script>
export default {
  name: "About.vue",
};
</script>
